{
  "hourOfAi.arenaProperty": "מחזיר את הערך של מאפיין הזירה שבה נמצא החרק שלך.\n* @param property – המאפיין שיש לקבל את ערכו.\n@returns – ערך המאפיין שצוין.",
  "hourOfAi.canSeeColor": "חוזר כשהחרק שלך יכול לראות צבע מסוים בכיוון שאליו הוא פונה כעת.\n* @param type – סוג הצבע שיש לחפש.\n@returns – כשהחרק שלך יכול לראות את הצבע שצוין.",
  "hourOfAi.canSeeOpponent": "חוזר כשהחרק שלך יכול לראות את החרק של היריב.\n* @returns – כשהחרק שלך יכול לראות את החרק של היריב.",
  "hourOfAi.distanceToColor": "מחזיר את המרחק בפיקסלים מהחרק שלך לפיקסל הקרוב ביותר של צבע מסוים בכיוון שאליו הוא פונה כעת. מחזיר 1- אם לא נראה פיקסל מאותו צבע.\n* @param type – סוג הצבע שיש לחפש.\n@returns – המרחק בפיקסלים מהחרק שלך לפיקסל הקרוב ביותר בצבע שצוין, או 1- אם לא נראה פיקסל באותו צבע.",
  "hourOfAi.distanceToOpponent": "מחזיר את המרחק בפיקסלים מהחרק שלך לחרק היריב, או 1- אם אי אפשר לראות את היריב.\n* @returns – המרחק בפיקסלים מהחרק שלך לחרק היריב, או 1- אם אי אפשר לראות את היריב.",
  "hourOfAi.distanceToWall": "מחזיר את המרחק בפיקסלים מהחרק שלך לקיר הקרוב ביותר בכיוון שאליו הוא פונה כעת.\n* @returns – המרחק בפיקסלים מהחרק שלך לקיר הקרוב ביותר.",
  "hourOfAi.doAfter": "מריץ קוד לאחר שחלף מספר מסוים של מילישניות\n* @param millis – מספר המילישניות שיש להמתין לפני הרצת הקוד.",
  "hourOfAi.doAfter|param|handler": "הקוד להפעלה.",
  "hourOfAi.every": "מריץ קוד במרווח זמן קבוע במילישניות.\n* @param millis – מספר המילישניות בין כל פעם שהקוד פועל.",
  "hourOfAi.every|param|handler": "הקוד להרצת כל מרווח זמן.",
  "hourOfAi.onBumpWall": "מריץ קוד כאשר החרק שלך נתקל בקיר.\n* @param handler – הקוד שיפעל כאשר החרק שלך נתקל בקיר.",
  "hourOfAi.onStart": "מריץ קוד בתחילת המשחק.\n* @param handler – הקוד שיפעל בתחילת המשחק.",
  "hourOfAi.property": "מחזיר את ערך המאפיין של החרק שלך.\n* @param property – המאפיין שיש לקבל את ערכו.\n@returns – ערך המאפיין שצוין.",
  "hourOfAi.turnBy": "מסובב את החרק שלך במספר מסוים של מעלות.\n* @param degrees – מספר המעלות שיש לסובב, חיובי הוא עם כיוון השעון ושלילי הוא נגד כיוון השעון.",
  "hourOfAi.turnTowards": "מסובב את החרק שלך כך שיפנה לזווית מסוימת במעלות.\n* @param degrees – הזווית במעלות שאליה פונים, כאשר 0 = ימינה, 90 = למטה, 180 = שמאלה ו-270 = למעלה.",
  "hourOfAi.turnTowardsPosition": "מסובב את החרק שלך כך שיפנה לעמדה מסוימת בזירה.\n* @param x – קואורדינטת ה-x של המיקום שאליו יש לפנות.",
  "hourOfAi.turnTowardsPosition|param|y": "קואורדינטת ה-y של המיקום שאליו יש לפנות."
}